[
  {
    "path": "tutorials/01/",
    "title": "01. Building Graphs Layer by Layer",
    "description": "Gentle introduction to ggplot2: how to create a plot object, add data,\ncreate a mapping, and add layers.",
    "author": [
      {
        "name": "Iñaki Ucar",
        "url": {}
      }
    ],
    "date": "2022-10-05",
    "categories": [
      "Chapter 2"
    ],
    "contents": "\n\nContents\nPreliminaries\nWorkflow\nReading the documentation\nCheckpoint 1\nRequired packages\n\nFirst steps\n\nPreliminaries\nThe goal of this tutorial is to provide a gentle introduction to ggplot2.\nWe will learn to create and manipulate a ggplot object, add data,\ncreate a mapping of data to visual channels, and add layers of visual marks.\nThe best way to follow this tutorial is by using the\nRStudio IDE,\nso ensure that you have it installed in your computer (along with R).\nWorkflow\nTo start with, let’s create a new project by clicking on File > New Project....\nFollow the steps to give it a sensible name (e.g., “dataviz”)\nand place it under a proper path in your computer.\nThis creates a new folder where you can save all your files (scripts, plots, data…) related to this course,\npreferably organized following some logic (e.g., all scripts under a scripts subdirectory, etc.).\nNow, whenever you return to your project\n(if you close and open RStudio again, your last project is automatically opened;\notherwise, click File > Recent Projects > ...),\nRStudio automatically sets the working directory (both of the file manager as well as the R session) to the project folder.\nOnce you open a new script (File > New File > R Script), the interface is divided in four sections:\nEditor (top-left), where you can edit the script file.\nConsole (bottom-left), where you can execute R commands in the current R session.\nEnvironment (top-right), where you can inspect the variables defined in the current R session.\nFiles / Plots / Packages / Help / Viewer (bottom-right), where you can browse your files,\nshow your plots, inspect the installed packages, read the manual pages…\nSave that empty script (Ctrl + S) using a sensible name (e.g., 01-building_graphs_layer_by_layer.R)\nin your project folder (or some subfolder according to your organization logic).\nNow, the recommended workflow is to copy the chunks of code you’ll find in this tutorial into your script,\nand there you can run it (by selecting some lines and hitting Ctrl + Enter,\nor just hitting Ctrl + Enter sequentially to run code line by line), modify it, and try again.\nBe sure to save your progress with some frequency, just in case,\nand to comment your code (# comments starts with a hashtag like this).\nFuture-you will thank you.\nReading the documentation\nA very important skill for every programming language is learning how to read its documentation.\nIn R, we can quickly open the manual page for any function just by typing ?name-of-the-function in the console, for example, ?mean (try this yourself).\nThen, you’ll always find the same structure, more or less:\nDescription of the function, what the function does.\nUsage, how to call the function, sometimes with different objects.\nArguments, the description of every argument shown in the usage section.\nValue, what the function returns.\nOptionally, other sections with more details.\nOptionally, References.\nOptionally, a list of related functions called See Also.\nOptionally, but usually, Examples of usage.\nCheckpoint 1\nEnsure that you have\ncreated a new project for the course;\ncreated a new script in your project for this tutorial;\nlocated all the relevant panels and parts of the IDE;\nfigured out how to save the file;\nfigured out how to send the code from the script to the console for execution;\nbecome accustomed to the documentation.\nRequired packages\nFor this tutorial, we need these packages\n(run the following to install them if you don’t have them already):\n\n\ninstall.packages(\"ggplot2\")\n\n\nFirst steps\nFollow the First steps tutorial\nfrom the ggplot2 book, and use the proposed exercises as checkpoints.\n\n\n\n",
    "preview": {},
    "last_modified": "2022-10-05T17:39:47+02:00",
    "input_file": {}
  }
]
